x<-seq(-10,10,0.1)
y<-1/(1+(exp(-x)))
plot(x,y,type="l",ylab="P(Y=1|X)")

slice<-c(3.30,3.19,0,4.51,0.98,1.65,0,1.01,3.55,1.27,
         1.43,3.34,1.13,2.15,1.63,4.88,6.62,3.61,6.45,
         1.41,0,2.91,1.49,1.37,3.25,2.31,0,1.9,2.72,
         1.78,4.92,3.7,2.28,0,0.71,0,3.09,3.84,3.68,
         3.14,0.66,0.85,1.75,1.57)
slice_sort<-sort(slice,decreasing = TRUE)
names(slice_sort)<-c("企业法院被执行信息","企业负责人法院被执行信息",
                     "近6个月平均月出票量","机票销售代理资质种类"
                     ,"近6个月平均非机票月销售额",
                     "","","","","","","","","","","","",
                     "","","","","","","","","","","","",
                     "","","",
                     "主要经营场面积","","","员工人数","","","年龄"
                     )
pie(slice_sort,col=rainbow(length(slice)),main="重要度")
